tutorials/PFB_2D_OversetMesh/background/0.org/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(inlet|outlet|stationaryWalls|atmosphere|floatingObject)"
    {
        type            zeroGradient;
    }
    frontAndback
    {
        type            empty;
    }
    "(oversetPatch)"
    {
         patchType       overset;
         type            zeroGradient;
    }
}


// ************************************************************************* //
