tutorials/PFB_2D_OversetMesh/background/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
	//poroussixDoFMooring
    //"liboverset.so"
    //"libdynamicOversetFvMesh.so" 

    "liboversetPadding.so"
    
    "libporoussixDoFRigidBodyMotion.so"
);

application     porousolaFlow;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         52;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

compression     off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;
maxAlphaCo      0.2;
maxDeltaT       0.05;

functions
{  
       //#include "forceCoeffs" 
       #includeFunc  sampleDict

}


// ************************************************************************* //
