tutorials/PFB_2D_OversetMesh/background/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volScalarFieldValue porosityIndex 0
    volScalarFieldValue  zoneID      0
);

regions
(
    boxToCell
    {
        box (-100 -100 -100) (100 100 0.60);
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }
    
    cellToCell
    {
        set porousCells;

        fieldValues
        (
            volScalarFieldValue porosityIndex 1
        );
    }
    
    cellToCell
    {
        set backgroundCells;
        fieldValues (
              volScalarFieldValue  zoneID  0
                    );
    }
    cellToCell
    {
        set oversetCells;
        fieldValues (
              volScalarFieldValue  zoneID  1
                    );
    }
);


// ************************************************************************* //
